LEXICON_CONTACTS: dict[str, str] = {
    "faq": "https://t.me/e_zov_teh",  # добавить ссылку на FAQ сайта
    "support": "https://t.me/e_zov_teh",  # добавить ссылку на тех. поддержку
    "referal_link": "https://t.me/mafiya_zov_bot?start={id}",
}


LEXICON_START: dict[str, str] = {
    "script": "Сценарий",
    "profile": "Профиль",
    "info": "Информация"
}

LEXICON_START_TEXT: dict[str, str] = {
    "start_text": "Приветствую тебя {user_name}!\n\n"
                  "Я готов провести незабываемую игру для тебя и твоей компании!\n\n"
                  "Осмотрись, я приготовил для вас много интересных сценариев..."
}

LEXICON_PROFILE: dict[str: str] = {
    "info_user": "💰 Золото: {gold}"
                 "💎 Камни: {stones}"
                 "🛡 Защита: {protection}"
                 "📂 Документы: {documents}"
                 "📀 Антивирус: {antivirus}"
                 "🎎 Активная роль: {active_role}"
                 "☠ Бронебойная пуля: {bullet}"
                 "⚠ Настройка использования предметов не применяется во время игры! "
                 "Предметы купленные во время игры не работают!"
}